Tekla Open API Reference for Tekla Structures 2025
ProfileItemEnumerator.Current Property
 Returns a profile item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItem Current { get; }
Public ReadOnly Property Current As ProfileItem
	Get
Property Value
Type: ProfileItem
See Also
Reference
ProfileItemEnumerator Class
Tekla.Structures.Catalogs Namespace